# -*- coding:utf-8 -*-


def filter_dot(word):
    '''
    处理类似于 直播足球比赛,4316,23400000,0,0,0,-,5,29,14 这样的字符串
    :param word:
    :return:
    '''
    if len(word) > 0:
        word_split_arr = word.split(',')
        if len(word_split_arr) > 9:
            word_split_arr = word_split_arr[0:-9]
            final_str = ''.join(word_split_arr)
            return final_str
        else:
            return word


word_list = [
    '直播足球赛',
    '"足球比赛直播,4328,584000,0,0,0,-,0,0,0',
    '直播足球比赛,4316,23400000,0,0,0,-,5,29,14',
    '足-球,直-播,软-件,2395,884000,0,0,6,-,0,0,5',
    '足球直播的,2373,2940000,0,0,0,-,0,0,4',
    '直播足球的,2363,4230000,0,0,0,-,0,0,10',
    '现场足球直播,2210,8410000,0,0,0,-,2,0,10',
    '体育直播足球,1929,19800000,0,0,3,-,19,17,12',
    '体育足球直播,1926,22900000,0,0,0,-,5,25,13',
    '在线足球直播,1878,1760000,0,0,59,-,2,6,12',
    '足球直播在线,1878,233000,0,0,未收录,-,0,2,18',
    '直播中国足球,1601,3010000,0,0,0,-,6,2,5',
    '足球吧直播,1582,3950000,0,0,997,-,12,22,12',
    '足球360直播,1558,10200000,0,0,8,-,18,199,8',
    '足球竞彩比分直播,1412,67700,0,0,130,-,0,0,0',
    '足球直播app,868,12100000,0,0,0,-,19,16,7',
    '手机足球直播,854,2280000,0,0,0,-,2,40,12',
    '足球比分足球直播,816,1740000,0,0,未收录,1,0,0,0',
    '亚洲杯足球直播,798,5810000,0,0,0,-,21,0,12',
    '足球直播中超,770,19200000,0,0,0,-,10,150,14',
    '足球比分直播即时比分,734,2,0,0,1024,-,0,0,0',
    '足球比分直播即时比分"',
    '足球直播台',
]

for word in word_list:
    word = word.strip('"')
    filter_dot(word)
