# -*- coding:utf-8 -*-
# @ProjectName: flutter_lesson
# @Email	  : 276517382@qq.com
# @FileName   : 婚纱摄影.py
# @DATETime   : 2020-04-30 下午 03:38
# @Author     : 笑看风云


import random


def piece_together_keywor():
    """
    组合关键词
    代孕 助孕

    "多少","怎么","怎样","哪","吗"
    在使用组合关键词时，需要判断是否包含如上字符串，
    如果有则需要加上问号，且整个作为标题使用；
    如果没有，则作为关键词和分隔符和其它截取的字符串作为标题使用；

    :return:
    """
    p1 = []
    save_file = "../../my_files/组合关键词/婚纱摄影.txt"
    new_arr = []
    with open("../../my_files/project_files/2020年2月县级以上行政.txt", mode="r", encoding="UTF-8") as p1fr:
        for line in p1fr:
            p1.append(line.strip())
    p2 = ["{}个性婚纱摄影", "{}主题婚纱摄影", "{}伯爵婚纱摄影", "{}全外景婚纱摄影", "{}十大婚纱摄影排名", "{}哪个婚纱摄影好", "{}哪家婚纱摄影拍的好", "{}哪家的婚纱摄影好",
          "{}唯一婚纱摄影", "{}城市花园婚纱摄影", "{}大城小爱婚纱摄影", "{}天长地久婚纱摄影", "{}婚纱写真摄影", "{}婚纱摄影", "{}婚纱摄影价格", "{}婚纱摄影价格表",
          "{}婚纱摄影公司", "{}婚纱摄影前十名", "{}婚纱摄影前十强", "{}婚纱摄影加盟", "{}婚纱摄影哪家好", "{}婚纱摄影哪家拍的好", "{}婚纱摄影哪家最好", "{}婚纱摄影团购",
          "{}婚纱摄影套餐", "{}婚纱摄影官网", "{}婚纱摄影工作室", "{}婚纱摄影店", "{}婚纱摄影排名", "{}婚纱摄影排行", "{}婚纱摄影排行榜", "{}婚纱摄影服务", "{}婚纱摄影活动",
          "{}婚纱摄影照", "{}婚纱摄影网", "{}婚纱摄影网站", "{}婚纱艺术摄影", "{}室内婚纱摄影", "{}室外婚纱摄影", "{}左岸婚纱摄影", "{}巴黎春天婚纱摄影", "{}提拉米苏婚纱摄影",
          "{}施洛华婚纱摄影", "{}旅拍婚纱摄影", "{}旅游婚纱摄影", "{}时尚婚纱摄影", "{}最好的婚纱摄影", "{}未来海岸婚纱摄影", "{}水下婚纱摄影", "{}水晶之恋婚纱摄影",
          "{}波西米亚婚纱摄影", "{}浪漫婚纱摄影", "{}爱诺婚纱摄影", "{}米兰婚纱摄影", "{}纯爱婚纱摄影", "{}羽映像婚纱摄影", "{}芭比公主婚纱摄影", "{}苏菲亚婚纱摄影",
          "{}著名婚纱摄影", "{}蒙娜丽莎婚纱摄影", "{}薰衣草婚纱摄影", "{}金夫人婚纱摄影", "{}钟爱一生婚纱摄影", "{}韩式婚纱摄影", "{}韩式婚纱摄影网站", "{}风尚国际婚纱摄影",
          "{}高端婚纱摄影"]

    for k1 in p1:
        for k2 in p2:
            title = k2.format(k1)
            print(title)
            new_arr.append(title)
    random.shuffle(new_arr)
    with open(save_file, mode="w", encoding="UTF-8") as kwr:
        kwr.write("\n".join(new_arr))


if __name__ == "__main__":
    piece_together_keywor()
