# -*- coding:utf-8 -*-
# @ProjectName: flutter_lesson
# @Email	  : 276517382@qq.com
# @FileName   : 注册公司.py
# @DATETime   : 2020-04-30 下午 03:17
# @Author     : 笑看风云


import random


def piece_together_keywor():
    """
    组合关键词

    "如何","多少","怎么","怎样","哪","吗"
    在使用组合关键词时，需要判断是否包含如上字符串，
    如果有则需要加上问号，且整个作为标题使用；
    如果没有，则作为关键词和分隔符和其它截取的字符串作为标题使用；

    :return:
    """
    p1 = []
    save_file = "../../my_files/组合关键词/注册公司.txt"
    new_arr = []
    with open("../../my_files/project_files/2020年2月县级以上行政.txt", mode="r", encoding="UTF-8") as p1fr:
        for line in p1fr:
            p1.append(line.strip())
    p2 = ["代办注册公司", "代理公司注册", "代驾公司注册", "公司名称注册", "公司注册", "公司注册信息查询", "公司注册地址", "公司注册场地", "公司注册平台", "公司注册查询", "公司注册流程",
          "公司注册流程及费用", "公司注册程序", "公司注册费用", "公司注册资本", "公司注册资金要求", "分公司注册流程", "商标注册公司", "外贸公司注册流程", "外贸公司注册资金", "如何注册公司",
          "工商局注册公司查询", "工商注册代理公司", "广告公司注册程序", "怎么注册公司", "怎样注册投资公司", "怎样注册新公司", "投资公司注册资本", "新公司注册流程", "有限公司注册",
          "有限公司注册流程", "有限公司注册程序", "有限责任公司注册资本", "查询公司注册信息", "注册一个投资公司", "注册公司", "注册公司代理", "注册公司名称查询", "注册公司哪家好",
          "注册公司多少钱", "注册公司查询", "注册公司流程", "注册公司流程和费用", "注册公司的程序", "注册公司程序", "注册公司要哪些条件", "注册公司费用", "注册公司需要什么条件",
          "注册公司需要多少钱", "注册外贸公司", "注册外资公司", "注册广告传媒公司", "注册开曼公司", "注册投资公司", "注册海外公司", "注册离岸公司", "注册贸易公司", "离岸公司注册",
          "股份公司注册资本", "贸易公司注册多少钱", "贸易公司注册资金"]

    for k1 in p1:
        for k2 in p2:
            title = k1 + k2
            print(title)
            new_arr.append(title)
    random.shuffle(new_arr)
    with open(save_file, mode="w", encoding="UTF-8") as kwr:
        kwr.write("\n".join(new_arr))


if __name__ == "__main__":
    piece_together_keywor()
