# -*- coding:utf-8 -*-
# @ProjectName: flutter_lesson
# @Email	  : 276517382@qq.com
# @FileName   : 离婚律师.py
# @DATETime   : 2020-04-30 下午 02:52
# @Author     : 笑看风云


import random


def piece_together_keywor():
    """
    组合关键词

    "多少","怎么","怎样","哪","吗"
    在使用组合关键词时，需要判断是否包含如上字符串，
    如果有则需要加上问号，且整个作为标题使用；
    如果没有，则作为关键词和分隔符和其它截取的字符串作为标题使用；

    :return:
    """
    p1 = []
    save_file = "../../my_files/组合关键词/离婚律师.txt"
    new_arr = []
    with open("../../my_files/project_files/2020年2月县级以上行政.txt", mode="r", encoding="UTF-8") as p1fr:
        for line in p1fr:
            p1.append(line.strip())
    p2 = ["专业离婚律师", "专业离婚律师电话", "代理离婚律师", "免费离婚律师", "免费离婚律师咨询", "办理离婚律师", "协议离婚律师", "咨询离婚的律师", "婚姻离婚律师咨询", "律师代理离婚",
          "律师可以代理离婚吗", "律师在线咨询离婚", "律师离婚咨询", "打离婚官司的律师", "打离婚律师", "找律师咨询离婚", "找律师离婚多少钱", "找离婚律师", "最好的离婚律师", "涉外离婚律师",
          "知名离婚律师", "离婚专业律师", "离婚代理律师", "离婚协议律师", "离婚咨询律师", "离婚在线咨询律师", "离婚女律师", "离婚官司律师费", "离婚律师", "离婚律师事务所",
          "离婚律师事务所咨询", "离婚律师价格", "离婚律师咨询", "离婚律师咨询在线", "离婚律师咨询电话", "离婚律师哪家好", "离婚律师在线咨询", "离婚律师多少钱", "离婚律师排名", "离婚律师收费",
          "离婚律师收费标准", "离婚律师电话", "离婚律师的费用", "离婚律师要多少钱", "离婚律师费", "离婚律师费标准", "离婚律师费用", "离婚律师费用多少", "离婚律师费用收取标准",
          "离婚律师费用是多少", "离婚房产律师", "离婚找律师", "离婚案件律师", "离婚案件律师费多少", "离婚纠纷律师", "离婚诉讼律师", "离婚请律师", "离婚请律师多少钱", "离婚请律师的费用",
          "离婚请律师要多少钱", "离婚请律师费用多少", "离婚财产律师", "离婚起诉律师", "网上离婚律师咨询", "请离婚律师", "请离婚律师多少钱", "资深离婚律师", "起诉离婚律师费多少",
          "起诉离婚律师费用", "金牌离婚律师"]

    for k1 in p1:
        for k2 in p2:
            title = k1 + k2
            print(title)
            new_arr.append(title)
    random.shuffle(new_arr)
    with open(save_file, mode="w", encoding="UTF-8") as kwr:
        kwr.write("\n".join(new_arr))


if __name__ == "__main__":
    piece_together_keywor()
